Revit 2027 API
OptionalFunctionalityUtils.IsAXMImportLinkAvailable Method
Note: This API is now obsolete.
 Checks whether the AXM Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool IsAXMImportLinkAvailable()
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function IsAXMImportLinkAvailable As Boolean
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool IsAXMImportLinkAvailable()
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member IsAXMImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the AXM Import/Link functionality is available in the installed Revit.
Remarks
 AXM Import/Link is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace